## Pandas

#### Pandas is a Python library used for working with data sets.

#### It has functions for analyzing, cleaning, exploring, and manipulating data.

- Pandas allows us to analyze big data and make conclusions based on statistical theories.

- Pandas can clean messy data sets, and make them readable and relevant.

- Relevant data is very important in data science.

### Pandas Data Structure

- Series (1 Dimensional)
- DataFrame (2 Dimensional)

### Series  (1 Dimensional)

A Series is a one-dimensional labeled array in pandas. It can hold data of various types, including integers, floats, strings, and more.

In [ ]:
# syntax

pd.Series(variable_name)     # Series  -->S capital in Series

#### import libary

In [54]:
import pandas as pd

#### Creating Series :

- list
- tuple
- dictionary
- Array

### list

In [55]:
# Creating a Series using a list

l1 =[10,20,30,40,50,60,70]

l1

[10, 20, 30, 40, 50, 60, 70]

#### example

In [56]:


a1 =pd.Series(l1)

a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [57]:
type(a1)

pandas.core.series.Series

#### dictionary

In [58]:
# Creating a Series using a dictionary

d = {1:"One",2:"two",3:"three",4:"four"}

d

{1: 'One', 2: 'two', 3: 'three', 4: 'four'}

In [59]:
# example

s2=pd.Series(d)

s2

1      One
2      two
3    three
4     four
dtype: object

In [60]:
type(s2)

pandas.core.series.Series

### set

In [61]:
set1 = {1,2,3,4,5,6,7}      # Attempting to create a Series from a set (which is not supported)

set1

{1, 2, 3, 4, 5, 6, 7}

In [62]:
s2=pd.Series(set1)

s2

TypeError: 'set' type is unordered

#### array

In [63]:
import numpy as np

In [77]:
n1 =np.arange(1,11)

n1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [78]:
s3=pd.Series(n1)

s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [79]:
type(s3)

pandas.core.series.Series

In [67]:
s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

### Rename

In [ ]:
rename->index
replace->values

#### syntax

#syntax

variable_name.rename({old_index:new_index,old_index:new_index},inplace=True)

In [80]:
s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [81]:
# example


s4 =s3.rename({2:9})       # Renaming index labels of a Series

s4

0     1
1     2
9     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [83]:
s4[9]

9     3
9    10
dtype: int32

In [82]:
s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [76]:
s3

0       1
1       2
two     3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
dtype: int32

### replace()

#### replace single value

syntax:
    varaible_name.replace(old_vlaue,New_value,inplace=True)

#### replace Multiple values

syntax:
variable_name.replace([old_value1,old_value2,___old_valueN],[New_value1,New_value2,...New_valueN],inplace=True)

#### example

In [85]:
# replace single value


a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [145]:
# example

s5=a1.replace(10,"ten")          # Replacing values in a Series

s5

0    ten
1     20
2     30
3     40
4     50
5     60
6     70
dtype: object

In [87]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

### sort_index()

variable_name.sort_index()         ->ascending

variable_name.sort_index(ascending=False)     ->decending

In [88]:
names =['Deoyani','Tanvi','Neha','Rushabh','Sameer','Chaitanya','Alankar','Kapil','Sujit','Pavan']


names

['Deoyani',
 'Tanvi',
 'Neha',
 'Rushabh',
 'Sameer',
 'Chaitanya',
 'Alankar',
 'Kapil',
 'Sujit',
 'Pavan']

In [89]:
s6=pd.Series(names)

s6

0      Deoyani
1        Tanvi
2         Neha
3      Rushabh
4       Sameer
5    Chaitanya
6      Alankar
7        Kapil
8        Sujit
9        Pavan
dtype: object

In [90]:
type(s6)

pandas.core.series.Series

#### example

In [92]:
v1= s6.sort_index()

v1

0      Deoyani
1        Tanvi
2         Neha
3      Rushabh
4       Sameer
5    Chaitanya
6      Alankar
7        Kapil
8        Sujit
9        Pavan
dtype: object

In [93]:
v2= s6.sort_index(ascending=False)

v2

9        Pavan
8        Sujit
7        Kapil
6      Alankar
5    Chaitanya
4       Sameer
3      Rushabh
2         Neha
1        Tanvi
0      Deoyani
dtype: object

### sort_values()

In [95]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [106]:
# example

v3=a1.sort_values(inplace=True)

v3

In [107]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [101]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [102]:
v4=a1.sort_values(ascending=False,inplace=True)

v4

In [103]:
a1

6    70
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int64

In [104]:
a1

6    70
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int64

In [117]:
m1 = pd.Series([1,2,3,4,5])

m2 = pd.Series([1,2,3,4,5])

In [119]:
c= m1**m2

c

0       1
1       4
2      27
3     256
4    3125
dtype: int64

In [122]:
c[3]

256

In [115]:
#################################################################################

### DataFrame()

- A DataFrame is a two-dimensional labeled data structure in pandas.It's similar to a table in a relational database or an Excel spreadsheet.

- A DataFrame consists of multiple Series organized as columns, and each column can hold data of different types.

In [123]:
df = pd.DataFrame([[10,20,30],[22,56,78],[4,8,2],[23,67,45]])

df

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

syntax:
    
df[column][row]

#### example

In [126]:
df[2][1]       # Accessing values in a DataFrame

78

In [127]:
df

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

## read files

### read_csv()

In [132]:
# df2 = pd.read_csv(r"Employee.csv")

# df2

In [128]:
df = pd.read_csv(r"C:\Users\Acer\FIREBLAZE\Employee.csv")    # encoding="latin"

df

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

### head()

In [133]:
df.head()

     Id gender    city  experience   salary
0  1001      M    pune           1  10000.0
1  1002      F  mumbai           5  50000.0
2  1003      M    pune           4      NaN
3  1004      M    beed           6  60000.0
4  1005      F    beed           7  70000.0

In [134]:
df.head(12)              # Displaying the first few rows of a DataFrame

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0

### tail()

In [135]:
df.tail()                          # Displaying the last few rows of a DataFrame

      Id gender      city  experience   salary
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [136]:
df.tail(10)

      Id gender      city  experience   salary
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

### info()

In [137]:
df.info()                    # Getting information about a DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          15 non-null     int64
 1   gender      15 non-null     object
 2   city        15 non-null     object
 3   experience  15 non-null     int64
 4   salary      14 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 728.0+ bytes

### describe()

In [138]:
df.describe()           # Describing the statistical summary of a DataFrame

                Id  experience        salary
count    15.000000   15.000000     14.000000
mean   1008.000000    4.933333  50000.000000
std       4.472136    2.491892  25720.389996
min    1001.000000    1.000000  10000.000000
25%    1004.500000    3.500000  32500.000000
50%    1008.000000    5.000000  50000.000000
75%    1011.500000    6.500000  67500.000000
max    1015.000000    9.000000  90000.000000

### sample()

In [141]:
df.sample()             # Sampling random rows from a DataFrame

      Id gender    city  experience   salary
14  1015      M  nagpur           5  50000.0

In [144]:
df.sample(5)

      Id gender      city  experience   salary
13  1014      M    gondia           8  80000.0
1   1002      F    mumbai           5  50000.0
9   1010      F      pune           3  30000.0
2   1003      M      pune           4      NaN
5   1006      M  bhandara           5  50000.0

### rename

#syntax

variable_name.rename({old_index/column:new_index/column,old_index/column:new_index/column},inplace=True)

### replace

# replace only one value

variable_name.replace(old_value,new_value,inplace=True)

# replace multiple values

variable_name.replace([old_value1,old_value2,old_value3],[new_value1,new_value2,new_value3],inplace=True)

### indexing

loc  ---> Label based indexing
iloc ---> integer based indexing

### iloc

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column.

#### Selecting rows using integer indices

In [ ]:
# df1.iloc[[2,5,8,11]]

#### Selecting a range of columns and rows simultaneously

In [52]:
# data.iloc[1: 5, 2: 5]

#df1.iloc[:,[0,3,4]]

### loc

The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select.

In [ ]:
# df1.loc[[5,10,7],['Id','salary','gender']]

# df1.loc[(df1.salary>=60000)]

# df1.loc[(df1.salary>=60000) & (df1.gender=='F') & (df1.city=='nagpur') ]

### duplicated()

In [ ]:
#file data



# df1.duplicated(subset=['sub6'])

### drop_duplicates()

## null value check

In [22]:
# df1.isnull().any()
# df1.isnull().sum()

### concat()

In [23]:
# d1=pd.DataFrame({'Letter':['A','B','C'],'Number':[1,2,3]})

# d1


# d2=pd.DataFrame({'Letter':['D','E','F'],'Number':[4,5,6]})

# d2

In [ ]:
# s=pd.concat((d2,d1),axis=0)

# s

### Merge

- inner
- left
- right
- outer

#### syntax

pd.merge(dataframe1,dataframe2,on='column_name',how='merging_method')

In [ ]:
# a1=pd.DataFrame({'Name':['monoj','kartik','nancy'],'ID':[101,102,103],'Cities':['Bhandara','nagpur','pune']})

# a1



# a2=pd.DataFrame({'Name':['priya','poonam','nikita'],'ID':[101,105,103],'Cities':['goa','hyd','mumbai']})

# a2

In [ ]:

# d3=pd.merge(a1,a2,on='ID',how='inner')

# d3

### inner

inner merge only show matching records from both the dataframe.

### left

display full records from left dataframe and only matching records from right dataframe

### right

display full records from right dataframe and only matching records from left dataframe

### outer

display full record from both the dataframes

### groupby()

The groupby is one of the most frequently used Pandas functions in data analysis. It is used for grouping the data points (i.e. rows) based on the distinct values in the given column or columns. We can then calculate aggregated values for the generated groups.

In [ ]:
#example

# g=df1.groupby('gender')

# g.get_group('M')

# g1.get_group('F')['salary']

# g.get_group('M')['salary'].mean()



# g2 = df1.groupby(['gender','city'])

# g2.get_group(('M','pune'))['salary']

In [1]:
import random

# Define the size of the 1D array (e.g., 10 elements)
array_size = 10

# Create an empty array to store the random integers
random_array = []

# Generate random integers and append them to the array
for _ in range(array_size):
    random_integer = random.randint(1, 100)  # You can adjust the range as needed
    random_array.append(random_integer)

# Print the resulting 1D array
print(random_array)

[75, 13, 87, 6, 21, 59, 27, 19, 91, 11]

In [2]:
type(random_array)

list